第1章 概述
  计算机网络(computer network ):在新的模式下，由大量独立的、但相互连接起来的计算机来共同完成计算任务的系统。
  Internet并不是一个单一的网络，而是一个由许多网络组成的网络；
  Web是一个分布式系统，它运行在Internet之上。

  计算机网络和分布式系统(distributed system)区别：在一个分布式系统中，一组独立的计算机展现给用户的是一个统一的整体，就好像一个系统。
  对用户来说，分布式系统只有一个模型或范型。在操作系统之上有一层软件中间件(middleware)负责实现这个模型。万维网(World Wide Wed)就是一个典型的分布式系统。
  分布式系统是建立在网络之上的软件系统，因此，分布式系统拥有高度的内聚性和透明性。
  因此，网络与分布式系统之间的区别更多地在于软件(特别是操作系统)。

 1.1 计算机网络的应用
 1.1.1 商业应用
   利用单独的计算机来监视生产过程，记录库存，以及管理工资的发放工作。
   连接多个计算机，关联公司信息，包括资源共享( resource sharing )。
   
   计算机网络的目标：企图打破“地理位置的束缚(tryanny of geography)”

   数据存储在性能较强大的计算机称为服务器(server).与之对应的是客户端(client).
   这个整体结构称为“客户-服务器模型(client-server model)”.
 1.1.2  
